tap "azure/functions"
tap "felixkratz/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "netbirdio/tap"
brew "azure-cli"
brew "bat"
brew "bottom"
brew "cloc"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "iperf3"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "luarocks"
brew "mysql-client"
brew "neovim"
brew "openjdk"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "rustup-init"
brew "rye"
brew "sevenzip"
brew "starship"
brew "subversion"
brew "tcping"
brew "tealdeer"
brew "telnet"
brew "terraform"
brew "wget"
brew "yadm"
brew "you-get"
brew "yq"
brew "azure/functions/azure-functions-core-tools@4"
brew "felixkratz/formulae/sketchybar"
brew "heroku/brew/heroku"
brew "netbirdio/tap/netbird"
cask "1password"
cask "1password-cli"
cask "airtame"
cask "alt-tab"
cask "arc"
cask "balenaetcher"
cask "cloudflare-warp"
cask "corretto"
cask "font-blex-mono-nerd-font"
cask "font-dm-mono"
cask "font-fira-code"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono"
cask "google-chrome"
cask "google-drive"
cask "hyper"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kitty"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "mos"
cask "orbstack"
cask "parallels"
cask "proton-drive"
cask "qqmusic"
cask "raycast"
cask "readdle-spark"
cask "shottr"
cask "tabby"
cask "tailscale"
cask "telegram-desktop"
cask "tencent-meeting"
cask "visual-studio-code"
cask "warp"
cask "wechat"
cask "wezterm"
cask "zerotier-one"
cask "zoom"
cask "zotero"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "richie5um2.vscode-sort-json"
vscode "usernamehw.errorlens"
