tap "felixkratz/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "bat"
brew "bottom"
brew "eza"
brew "gh"
brew "git-delta"
brew "go"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "k9s"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "ripgrep"
brew "rustup-init"
brew "sevenzip"
brew "starship"
brew "subversion"
brew "tealdeer"
brew "wget"
brew "yadm"
brew "yq"
brew "felixkratz/formulae/sketchybar"
brew "heroku/brew/heroku"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "arc"
cask "font-blex-mono-nerd-font"
cask "font-dm-mono"
cask "font-fira-code"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono"
cask "google-chrome"
cask "google-drive"
cask "hyper"
cask "iterm2"
cask "kitty"
cask "mos"
cask "orbstack"
cask "proton-drive"
cask "qqmusic"
cask "raycast"
cask "readdle-spark"
cask "shottr"
cask "tabby"
cask "telegram-desktop"
cask "visual-studio-code"
cask "warp"
cask "wechat"
cask "wezterm"
cask "zed"
cask "zerotier-one"
cask "zoom"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
