tap "azure/functions"
tap "felixkratz/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "natesales/repo", "https://github.com/natesales/repo"
brew "azure-cli"
brew "bat"
brew "bottom"
brew "eza"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "httpie"
brew "hyperfine"
brew "iperf3"
brew "jq"
brew "k9s"
brew "lazygit"
brew "luarocks"
brew "mysql-client"
brew "neovim"
brew "openjdk"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "rustup-init"
brew "sevenzip"
brew "starship"
brew "subversion"
brew "tcping"
brew "tealdeer"
brew "telnet"
brew "terraform"
brew "wget"
brew "yadm"
brew "yq"
brew "azure/functions/azure-functions-core-tools@4"
brew "felixkratz/formulae/sketchybar"
brew "heroku/brew/heroku"
brew "natesales/repo/q"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "arc"
cask "balenaetcher"
cask "corretto"
cask "font-blex-mono-nerd-font"
cask "font-dm-mono"
cask "font-fira-code"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono"
cask "google-chrome"
cask "google-drive"
cask "hyper"
cask "iterm2"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "mos"
cask "orbstack"
cask "parallels"
cask "proton-drive"
cask "qqmusic"
cask "raycast"
cask "readdle-spark"
cask "shottr"
cask "tabby"
cask "tailscale"
cask "telegram-desktop"
cask "visual-studio-code"
cask "warp"
cask "wechat"
cask "wezterm"
cask "zed"
cask "zerotier-one"
cask "zoom"
vscode "ahmadalli.vscode-nginx-conf"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "evan-buss.font-switcher"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mathworks.language-matlab"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "njqdev.vscode-python-typehint"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "yy0931.save-as-root"
